Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/disability_and_illness/disability_benefit.html.txt.tmx
Source language: en
Languages: ga

source: You may get Illness Benefit from the Department of Social Protection if you cannot work because you are sick or ill
ga: Níl Sochar Breoiteachta nasctha le polasaí d’fhostóra maidir le pá saoire bhreoiteachta

source: You must be aged under 66, covered by the appropriate class of social insurance (PRSI) and satisfy the PRSI conditions
ga: (Is féidir le d'fhostóir a pholasaí féin maidir le pá breoiteachta agus saoire bhreoiteachta a shocrú)

source: Illness Benefit is not linked to your employer's policy on pay for sick leave (your employer can decide their own policy on sick pay and sick leave)
ga: Mura mbíonn dóthain ranníocaíochtaí árachais shóisialta agat, ba chóir duit dul i dteagmháil le an t-ionadaí Roinne Coimirce Sóisialaí (a tugadh an tOifigeach Leasa Pobail air roimhe seo) agus measfaidh sé/sí do chás

source: More information is available in our document about sick leave and employment
ga: Déanfaidh an tIonadaí na Roinne measúnacht ar do chás agus is féidir go dtabharfaidh sé Liúntas Leasa Forlíontach duit

source: Whether your employer pays you or not while you are out sick from work, you should claim Illness Benefit from the first day of your illness – see “Rules” below
ga: Is faoin bhfostóir a bhíonn sé cinneadh a ghlacadh ar a pholasaí/polasaí féin maidir le pá breoiteachta agus saoire bhreoiteachta, faoi réir ag do chonradh nó ag téarmaí fostaíochta

source: If you get sick pay from work, you should ask your employer what administrative arrangements are in place while you are claiming Illness Benefit
ga: Léigh tuillleadh faoi saoire bhreoiteachta agus fostaíocht anseo

source: If your income is too low to meet your needs, while you are waiting for a decision on your claim for Illness Benefit, you may be entitled to basic Supplementary Welfare Allowance, which is a means-tested payment
ga: Sa chás go mbíonn teidlíocht i do chonradh fostaíochta chun pá breoiteachta a fháil, is dóigh go n-iarrfaidh d'fhostóir ort aon íocaíocht Sochair Breoiteachta ón Roinn Coimirce Sóisialaí a thabhairt ar láimh don fhostóir chomh fada agus a leanann an phá bhreoiteachta ar aghaidh

source: You must apply for Illness Benefit within 7 days of becoming ill
ga: Caithfidh tú cur isteach ar Shochar Breoiteachta i gceann 7 lá ón uair a d’éirigh tú tinn

source: No payment is made for the first 6 days of illness which are known as waiting days
ga: Ní dhéantar aon íocaíocht don chéad 6 lá den bhreoiteacht agus ní dhéantar aon íocaíocht d’aon Domhnach le linn do bhreoiteachta

source: (Note that Sunday is not counted as a waiting day.) The only time that the 6 waiting days are not applied is if you were getting certain other social welfare payments within 3 days of the start of your illness
ga: Nóta: ó 6 Eanáir 2014 síníodh é seo ó 3 lá go dtí 6 lá

source: Social insurance (PRSI) contributions
ga: Ranníocaíochtaí árachais sóisialta (ÁSPC)

source: To qualify for payment of Illness Benefit you must satisfy the following two conditions:
ga: Chun Sochar Breoiteachta a fháil ní mór duit:

source: 1. You must have at least 104 weeks of PRSI contributions paid since you first started work
ga: • Ar a laghad 104 seachtain ÁSPC (ag aicmí A, E, H nó P) íoctha ó thosaigh tú an obair den chéad uair

source: 2. 39 weeks of PRSI contributions paid or credited in the relevant tax year, of which 13 must be paid contributions. If you do not have 13 paid contributions in the relevant tax year, then 13 paid contributions in one of the following tax years can be used instead: □ Either of the two tax years before the relevant tax year
ga: • 39 seachtaine ÁSPC a bheith íoctha nó curtha chun sochair agat sa Bhliain Chánach Ábhartha (ní mór go ranníocaíochtaí íoctha iad ar a laghad 13 seachtaine acu*)

source: 26 weeks of PRSI contributions paid in the relevant tax year, and 26 weeks of PRSI contributions paid in the tax year immediately before the relevant tax year
ga: • 26 seachtaine ÁSPC a bheith íoctha sa Bhliain Cánach Ábhartha agus 26 seachtaine ÁSPC íoctha sa bhliain cánach díreach roimh an mBliain Cánach Ábhartha

source: The relevant tax year is the second-last complete tax year before the year in which your claim for Illness Benefit begins. For example:
ga: *Mura mbíonn na 13 ranníocaíochtaí íoctha agat sa Bhliain Chánach Ábhartha, is féidir na blianta ina dhiaidh sin a úsáid chun an coinníoll sin a chomhlíonadh:

source: │If your claim begins in: │The relevant tax year is: │
ga: • An dara bhliain chánach agus an triú bliain chánach is iomláine roimhe

source: • Only PRSI contributions paid at class A, E, H and P count towards Illness Benefit
ga: • An bhliain chánach reatha

source: • If you were getting long-term Jobseeker's Allowance, Pre-Retirement Allowance, Invalidity Pension, Carer's Allowance or Carer's Benefit immediately before applying for Illness Benefit, you do not need to have 13 paid contributions
ga: Má bhí Liúntas Cuardaitheora Poist fadtéarma á fháil agat (15 mhí), Liúntas Réamhscoir, Pinsean Easláinte, Liúntas Cúramóra nó Sochar Cúramóra láithreach sula ndearna tú iarratas ar Shochar Breoiteachta, ní gá duit 13 ranníocaíocht íoctha a bheith agat

source: • If you were getting Occupational Injury Benefit (OIB) immediately before applying for Illness Benefit you may use the tax year that applied to your OIB claim or the tax year that applies to your Illness Benefit claim, whichever is more beneficial
ga: Má tá LCP ar ráta laghdaithe á fháil agat nó má tá níos lú ná 260 ranníocaíocht ÁSPC agat, féadtar d’íocaíocht Sochar Breoiteachta a laghdú

source: To help you qualify for Illness Benefit, you may combine your Irish PRSI contributions with social insurance contributions from a country covered by EU Regulations (and the Channel Islands and the Isle of Man, which are covered under a bilateral agreement)
ga: Féadfaidh tú do ranníocaíochtaí ÁPSC Éireannacha a chur le rannaíocaíochtaí árachais shóisialta ó thír atá faoi chuimsiú Rialacháin an AE chun cáiliú do Shochar Breoiteachta

source: How long is Illness Benefit paid?
ga: Cén fhad a íoctar Sochar Breoiteachta?

source: • 2 years (624 payment days) if you have at least 260 weeks of reckonable social insurance contributions* paid since you first started work
ga: Má d’íoc tú 260 seachtain ÁSPC ó thosaigh tú den obair, féadfaidh tú Sochar Breoiteachta a éileamh ar feadh 2 bhliain ar a mhéid (624 lá íocaíochta)

source: • 1 year (312 payment days) if you have between 104 and 259 weeks of reckonable social insurance contributions* paid since you first started work
ga: Má d’íoc tú idir 104 agus 259 seachtain ÁSPC, féadfaidh tú Sochar Breoiteachta a éileamh ar feadh 52 seachtain (312 lá íocaíochta)

source: *Reckonable social insurance contributions paid in Ireland, EU countries, the Channel Islands and the Isle of Man can be combined for this purpose
ga: Nuair a chríochnaíonn tú d’éileamh ar Shochar Breoiteachta, féadfaidh tú athcháiliú le haghaidh Sochar Breoiteachta trí 13 ranníocaíocht bhreise ÁSPC a íoc (nó líon níos lú má mhéadaíonn sé iomlán do ranníocaíochtaí ÁSPC go dtí 260)

source: Before your payment is due to stop, you will be contacted by the Department of Social Protection telling you when payment will stop and giving you further information on options available:
ga: Roimh Eanáir 2009, bhí daoine a d’íoc ÁSPC 260 seachtain ó thosaigh siad den obair, i dteideal Sochar Breoiteachta a fháil a fhad a bhí siad neamhábalta chun oibriú agus faoi 66 bliain

source: • If you do not qualify for Invalidity Pension and you have a disability that is expected to last for a year or more, you may qualify for a means-tested Disability Allowance
ga: Nuair a thagann deireadh le do theidlíocht i leith íocaíocht Sochar Breoiteachta, d’fhéadfadh go mbeifeá i dteideal íocaíochtaí eile a fháil:

source: • If you do not qualify for any other payments and your income is too low to meet your needs, you may qualify for a basic Supplementary Welfare Allowance
ga: • Má tá tú breoite, agus más dóigh nach mbeidh tú in ann obair a dhéanamh feasta agus má chomhlíonann tú na coinníollacha ÁSPC, d’fhéadfadh go gcáileofaí thú don Phinsean Easláinte

source: • If your Illness Benefit is ending because you are turning 66, you may be eligible for a State Pension. You should apply 3 months before your 66th birthday
ga: • Mura gcáilítear thú don Phinsean Easláinte agus má tá tú faoi éagumas a mheastar a mhairfidh ar feadh bliana, d’fhéadfadh go gcáileofaí thú do Liúntas Míchumais a ndéanfar tástáil mhaoine ina leith

source: If you return to work, you must have a minimum of 13 reckonable PRSI contributions paid before you may requalify for Illness Benefit
ga: • Má bheidh deireadh ag teacht le do Shochar Breoiteachta mar gheall go mbeidh tú 66 bliain d’aois, d’fhéadfá bheith i dteideal Pinsean Stáit a fháil

source: (All other qualifying conditions must also be satisfied.)
ga: Ba cheart duit iarratas a dhéanamh 3 mhí roimh do bhreithlá 66 bliain d’aois

source: Transfer from Carer's Benefit or Carer’s Allowance
ga: Aistriú ó Shochar Cúramóra nó Liúntas Cúramóra

source: If you transfer from Illness Benefit to Carer's Benefit or Carer's Allowance and then back to Illness Benefit, your Illness Benefit will not be paid at a lower rate than that you were paid previously
ga: Má d’aistrigh tú ó Shochar Breoiteacha go Shochar Cúramóra nó Liúntas Cúramóra agus ansin ar ais go Sochar Breoiteachta, gheobhaidh tú Sochar Breoiteachta ar ráta nach ísle ná mar a bhí agat mar íocaíocht

source: The PCB scheme allows you to return to work (if you have a reduced capacity to work) and continue to receive a social welfare payment. A Medical Assessor (who is a doctor employed by the Department of Social Protection) will assess the restriction on your capacity for work, and the personal rate of PCB paid is based on this assessment. You cannot take up work until you have written approval to do so from the Department
ga: Ón 13 Feabhra 2012, cuirtear an Sochar Cumais Pháirtigh in ionad na socruithe díolúine a bhí ann roimhe seo, sa chás go bhféadfadh daoine ag a raibh Sochar Breoiteachta nó Pinsean Easláinte á fháil cead a fháil chun oibrithe go páirtaimseartha (ar a dtugtar díolúine) ar mhaithe le cuspóirí athshlánaithe nó teiripeacha agus a n-íocaíocht iomlán leasa shóisialaigh a choimeád

source: You cannot undertake a training or educational course or do voluntary work without prior, written approval from the Department of Social Protection
ga: Ní dhéanfar difear dóibh siúd ag a bhfuil an cead seo faoi láthair go dtí go mbeidh athbhreithniú le déanamh ar a gcead

source: You must apply to the Illness Benefit section for this approval
ga: Ag an tráth sin, ní bheidh fáil acu a thuilleadh ar an díolúine ach beidh sé de rogha acu iarratas a dhéanamh ar Shochar Cumais Pháirtigh

source: Since 1 January 2014, new participants on SOLAS training courses can retain Illness Benefit but they cannot get a training allowance or training bonus at the same time
ga: Ní gá go mbeidh an obair a dhéanann duine fad a bhíonn an Sochar Cumais Pháirtigh á fháil acu ar mhaithe le cuspóirí athshlánaithe nó teiripeacha

source: Illness Benefit and other social welfare payments
ga: Sochar Breoiteachta agus íocaíochtaí eile leasa shóisialaigh

source: │Blind Pension │If you are getting Blind Pension, you may also get Illness Benefit if you are ill and unable to work and you satisfy the PRSI conditions
ga: │Pinsean na nDall │Má tá Pinsean na nDall á fháil agat, d’fhéadfá Sochar Breoiteachta a fháil chomh maith, má bhíonn tú breoite agus neamhábalta chun oibriú agus má shásaíonn tú na coinníollacha ÁSPC

source: │ │If you are getting Illness Benefit and you satisfy the conditions for Carer's Allowance, you may get half the personal rate of Carer's Allowance along with your Illness Benefit payment
ga: │ │Má tá Sochar Breoiteachta á fháil agat agus má shásaíonn tú na coinníollacha le haghaidh Liúntas Cúramóra, féadfaidh tú Liúntas Cúramóra ar leath an ráta phearsanta a fháil mar aon le híocaíocht do Shochair Bhreoiteachta

source: │Carer's Allowance │ │
ga: │Liúntas Cúramóra │ │

source: │ │It may also be possible for you to receive an Increase for a Qualified Adult for someone on your Illness Benefit claim while they receive a half-rate Carer's Allowance for caring for you or someone else
ga: │ │Ina theannta sin, d’fhéadfá bheith in ann Méadú i leith Duine Fásta Cáilithe a fháil do dhuine ar d’éileamh ar Shochar Breoiteachta fad a fhaigheann siad Liúntas Cúramóra ar leathráta mar gheall ar chúram a thabhairt do dhuine eile

source: │Disablement Benefit │If you are getting Disablement Benefit, you may also get Illness Benefit if you are ill, unable to work and satisfy the PRSI conditions (provided that the Disablement Benefit payment does not include an increase for Incapacity Supplement)
ga: │Sochar Míchumais │Má tá Sochar Míchumais á fháil agat, d’fhéadfá Sochar Breoiteachta a fháil chomh maith, má bhíonn tú neamhábalta chun oibriú agus má shásaíonn tú na coinníollacha ÁSPC

source: │Domiciliary Care Allowance/Carer's Support Grant │Illness Benefit is payable if you are getting Domiciliary Care Allowance and/or the Carer's Support Grant (formerly Respite Care Grant)
ga: │Liúntas Cúram Baile/Deontas Cúram Faoiseamh │Tá Sochar Breoiteachta iníoctha má bhíonn Liúntas Cúram Baile agus/nó an Deontas Cúram Faoisimh á fháil agat

source: │Family Income Supplement (FIS) and Back to Work Family Dividend (BTWFD) │If you are receiving Family Income Supplement (FIS) and become ill, payment of FIS may continue with Illness Benefit for up to 36 days (6 weeks)
ga: │Forlíonadh Ioncam Teaghlaigh (FIS) agus Back to Work Family Dividend (BTWFD) │Má tá Forlíonadh Ioncaim Teaghlaigh (FIT) á fháil agat agus má éiríonn tú breoite, d’fhéadfaí FIT a íoc leat leis an Sochar Breoiteachta ar feadh 36 lá (6 seachtaine) ar a mhéid

source: Similarly if you become ill while you are getting Back to Work Family Dividend, payment of BTWFD may continue with Illness Benefit for 36 days (6 weeks)
ga: Mar an gcéanna, má fhaigheann tú an Díbhinn Teaghlaigh um Fhilleadh ar Obair (DTFAO) agus má éiríonn tú breoite, d’fhéadfaí DTFAO a íoc leat leis an Sochar Breoiteachta ar feadh 36 lá (6 seachtaine) ar a mhéid

source: │Widow’s, Widower’s or Surviving Civil Partner’s Pension (including occupational widow’s/widower’s pensions) and One-Parent Family Payment, Deserted Wife's Allowance/Benefit or Prisoner’s Wife's Allowance │If you are getting any of these payments at the full rate, you cannot get Illness Benefit at the same time
ga: Má tá ráta laghdaithe de cheann amháin de na híocaíochtaí seo á fháil agat, áfach, agus má éiríonn tú breoite, féadfaidh tú cáiliú chun ráta laghdaithe Sochar Breoiteachta a fháil a mhéadóidh d’íocaíocht iomlán chuig an ráta uasta pearsanta SB atá tú i dteideal a fháil. │

source: However, if you are getting a reduced rate of one of these payments and become ill, you may qualify for a reduced rate of Illness Benefit (so that the combined amount of both payments is not greater than the rate of Illness Benefit to which you are entitled)
ga: │ │Féadfaidh daoine a raibh aon cheann de na híocaíochtaí seo á bhfáil acu i dteannta an tSochair Bhreoiteachta roimh an 1 Feabhra 2012 leanúint agus an dá íocaíocht a fháil ag am céanna

source: Payment of Illness Benefit abroad
ga: Íocaíocht Sochar Breoiteachta thar lear

source: You may be called for medical assessment while living abroad (this is arranged by the Department with the Social Security Office of the country you are in)
ga: Féadfaidh tú leanúint agus Sochar Breoiteachta a fháil má fhágann tú Éire chun cónaí thar lear i dtír eile atá faoi chuimsiú Rialacháin an AE

source: You must attend for a medical assessment when asked, or your Illness Benefit will be suspended
ga: Ní mór duit an Roinn Coimirce Sóisialaí a chur ar an eolas roimh ré (nó seans go gcaillfidh tú d’íocaíocht nó go gcuirfear moill uirthi)

source: If you go to live in another country covered by EU Regulations and become ill, you may apply for Illness Benefit from Ireland if you paid your last insurance contribution in Ireland or you were getting Jobseeker’s Benefit in Ireland before you went abroad
ga: Má fhágann tú Éire chun cónaí i dtír eile atá faoi chuimsiú Rialacháin an AE, agus má éiríonn tú breoite, féadfaidh tú iarratas a dhéanamh ar Shochar Breoiteachta ó Éirinn má d’íoc tú do ranníocaíocht árachais dheireanach in Éirinn nó má bhí Sochar Cuardaitheora Poist á fháil agat in Éirinn sula ndeachaigh tú thar lear

source: Illness Benefit is not paid in countries not covered by EU Regulations
ga: Ní íoctar Sochar Breoiteachta i dtíortha nach bhfuil faoi chuimsiú Rialacháin an AE

source: However, if you go to a country not covered by EU Regulations to get approved treatment your payment may resume when you return. You can read detailed FAQs from the Department of Social Protection on claiming Illness Benefit abroad
ga: Má théann tú chuig tír nach bhfuil faoi chuimsiú Rialacháin an AE chun cóireáil fhaofa a fháil, féadtar leanúint le d’íocaíocht nuair a fhilleann tú

source: Reviews of Illness Benefit
ga: Athbhreithniú ar Shochar Breoiteachta

source: Your Illness Benefit claim will be reviewed from time to time and you may be asked to attend for a medical assessment
ga: Déanfar athbhreithniú ar do Shochar Breoiteachta ó am go chéile agus d’fhéadfaí iarraidh ort freastal ar mheasúnacht leighis

source: This assessment will be carried out by a Medical Assessor, who is a doctor employed by the Department of Social Protection
ga: Tabharfaidh Measúnóir Leighis faoin measúnacht seo. Is dochtúir an measúnóir leighis atá fostaithe ag an Roinn Coimirce Sóisialaí

source: The Medical Assessor will give an opinion on whether or not you are fit for work
ga: Luafaidh an Measúnóir Leighis a t(h)uairim faoi cibé acu an bhfuil nó nach bhfuil tú neamhábalta chun oibriú

source: You must attend for a medical assessment when asked, or your benefit will be suspended
ga: Ní mór duit freastal le haghaidh measúnacht leighis nuair a iarrtar ort, nó cuirfear do shochar ar fionraí

source: If your Illness Benefit is stopped, you have a right to appeal the decision - see ‘Where to apply’ below
ga: Má stoptar do Shochar Breoiteachta, tá sé de cheart agat an cinneadh a achomharc – féach ‘Cá ndéanfaidh mé iarratas?

source: If you are receiving credited contributions only and these are stopped, you can seek a review of the decision but you do not have a right to appeal it
ga: ’ thíos. Mura bhfuil ach ranníocaíochtaí curtha chun sochair á bhfáil agat agus má chuirtear stop leo seo, féadfaidh tú athbhreithniú ar an gcinneadh a lorg ach níl sé de cheart agat an cinneadh a achomharc

source: Usually no payment is made for the first 6 days of illness and no payment is made for any Sunday during your illness
ga: Ní dhéantar aon íocaíocht don chéad 6 lá den bhreoiteacht agus ní dhéantar aon íocaíocht d’aon Domhnach le linn do bhreoiteachta

source: Note that this was extended from 3 to 6 days from 6 January 2014
ga: Nóta: ó 6 Eanáir 2014 síníodh é seo ó 3 lá go dtí 6 lá

source: Illness Benefit rates are graduated according to your average weekly earnings in the relevant tax year
ga: Céimnítear na rátaí i gcomhair an tSochair Bhreoiteachta de réir do mheántuillimh seachtainíúil sa

source: │less than €150 │84.50 │80.90 │
ga: bhliain chánach a bhaineann le hábhar

source: Weekly payment from 13 March 2017 for claims started in 2009 or after
ga: Rátaí seachtainiúil ó 13 Márta 2017 le haghaidh éilimh a thosaigh i 2009 nó i ndiaidh sin

source: │Average weekly │Personal rate,│Qualified adult rate,│ │earnings │€ │€ │
ga: │Tuilleamh │Ráta Pearsanta │Ráta do Dhaoine Fásta Incháilithe │

source: │€300 or more │193 │128.10 │
ga: │€300 nó níos mó │€193.00 │€128.10 │

source: │less than €150 │86.70 │83 │
ga: │níos lú ná €150 │€86.70 │€83.00 │

source: Weekly payment from 13 March 2017 for claims started in 2008 or before:
ga: Rátaí seachtainiúil ó 13 Márta 2017 le haghaidh éilimh a thosaigh i 2008 nó roimhe sin

source: │€150 or more │193 │128.10 │
ga: │€150 nó níos mó │€193.00 │€128.10 │

source: │less than €80 │86.70 │83 │
ga: │níos lú ná €80 │€86.70 │€83.00 │

source: Illness Benefit can be paid directly into your bank, building society account
ga: Is féidir Sochar Breoiteachta a íoc isteach díreach i do chuntas bainc nó cumann foirgníochta

source: or to an account in a credit union which offers the facility for Electronic Funds Transfer (EFT)
ga: Féadfaidh tú méadú ar d’íocaíocht do dhuine fásta cleithiúnach a fháil

source: You can get an increase in your payment for an adult dependant or child dependant if you meet certain conditions
ga: Ní bhíonn aon tionchar ar mhéadú do leanbh cleithiúnach ag do mheántuilleamh seachtainiúil

source: Taxation of Illness Benefit
ga: Sochar Breoiteachta agus cáin

source: Illness Benefit, both the personal rate and Increase for a Qualified Adult, (excluding increases for child dependants) is considered to be income for tax purposes and it is taxable from the first day of payment
ga: Glactar le Sochar Breoiteachta (seachas aon mhéadú do leanaí cleithiúnacha) mar ioncam chun críche cánach agus tá sé inchánaithe ón chéad lá a íoctar é

source: Illness Benefit is paid directly to you without any deduction of income tax
ga: Íocfar Sochar Breoiteachta go díreach leat gan aon cáin ioncaim a asbhaint as

source: If you are employed, your employer will take your Illness Benefit into account for PAYE purposes
ga: Má tá tú fostaithe, glacfaidh d'fhostóir do Sochar Breoiteachta san áireamh chun críche ÍMAT

source: If you are unemployed, Revenue will take account of the amount of Illness Benefit paid to you when they adjust your tax credits or review the tax affairs of your spouse or civil partner
ga: Má tá tú dífhostaithe,glacfaidh na Coimisinéirí Ioncaim san áireamh an méid Sochar Breoiteachta atá íoctha leat, más cuí, nuair a bhítear ag coigeartú do chuid creidmheasanna cánach nó ag athbhreithniú cúrsaí cánach do chéile

source: Contact Revenue for more information
ga: Déan teagmháil leis na Coimisinéirí Ioncaim chun tuilleadh eolais a fháil

source: You should apply for Illness Benefit within 7 days of becoming ill
ga: Caithfidh tú iarratas ar Shochar Breoiteachta a dhéanamh laistigh de 7 lá ó fhaigheann tú tinn

source: A delay of more than 7 days may cause you to lose some of your payment
ga: Is féidir go gcaillfidh tú cuid de d'íocaíocht i gcás moill níos faide ná 7 lá

source: If there is a good reason for a delay in applying, your payment may be backdated
ga: Má tá cúis mhaith le moill i gcur isteach an iarratais, is féidir go siardhátófar d’íocaíocht

source: You can get a first social welfare medical certificate (known as MC1), which includes an application form for Illness Benefit, from your family doctor (GP) or hospital doctor
ga: Tá an fhoirm iarratais do Sochar Breoiteachta ar fáil ó do dhochtúir teaghlaigh (LG) nó ó dhochtúir ospidéil

source: The reason you can only get this form from a doctor is because a doctor must complete the medical certificate part of the form
ga: Tá sé amhlaidh toisc nach féidir leat an fhoirm seo a fháil ach amháin ó dhochtúir mar nach mór do dhochtúir cuid den fhoirm a chomhlánú. Ní sé ar fáil ar líne

source: You must see your doctor and send in an intermediate medical certificate (known as MC2) each week for as long as you are ill, unless you are told otherwise
ga: Ní mór duit teastas dochtúra a sheoladh isteach (ar a dtugtar MC 2) gach seachtain ar feadh fad do thinnis, mura n-iarrtar ort a mhalairt a dhéanamh

source: You must get a final medical certificate from your doctor before you go back to work
ga: Ní mór duit teastas dochtúra deireanach a fháil ó do dhochtúir sula bhfilleann tú ar obair
